2small_sylinder_sn0.25U02/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       fixedNetFoam;

startFrom         startTime;

startTime         0;

stopAt            endTime;

endTime           1600;

deltaT            0.01;

writeControl      adjustableRunTime;

writeInterval     0.5;

purgeWrite        0;

writeFormat       ascii;

writePrecision    6;

writeCompression  uncompressed;

timeFormat        general;

timePrecision     4;

graphFormat       raw;

// Other setting
runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             1;

// maxDeltaT         0.01;
// functions
// {
//     #includeFunc  probes;
//     #includeFunc  singleGraph1;
//     #includeFunc  singleGraph2;
// }
// ************************************************************************* //
