2small_sylinder_sn0.25U02/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.30     -0.3   -0.099 )    // vertex number 0
    (  1.20     -0.3   -0.099 )    // vertex number 1
    (  1.20      0.3   -0.099 )    // vertex number 2
    ( -0.30      0.3   -0.099 )    // vertex number 3
    ( -0.30     -0.3    0.000 )    // vertex number 4
    (  1.20     -0.3    0.000 )    // vertex number 5
    (  1.20      0.3    0.000 )    // vertex number 6
    ( -0.30      0.3    0.000 )    // vertex number 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (375 150 25) simpleGrading (1 1 1)
 			//			   x   y  z
            //dx=1 m
);

boundary
(
    left  // inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right  //outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (

            (0 3 2 1)
        );
    }

    front
    {
        type wall;
        faces
        (
            //(3 7 6 2)
            (1 5 4 0)
        );
    }
    back
    {
        type wall;
        faces
        (
            (3 7 6 2)
            //(1 5 4 0)
        );
    }


);

// ************************************************************************* //
