2small_sylinder_sn0.25U02/constant/netElement
FoamFile
{
    version     1906;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      element;
}
// >>>>>>>>>>>>>>>>>>>>>>>>>>Hui Cheng>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> //
{
numOfSurf   320;
e0	( 0	16	1 );
e1	( 17	1	16 );
e2	( 1	17	2 );
e3	( 18	2	17 );
e4	( 2	18	3 );
e5	( 19	3	18 );
e6	( 3	19	4 );
e7	( 20	4	19 );
e8	( 4	20	5 );
e9	( 21	5	20 );
e10	( 5	21	6 );
e11	( 22	6	21 );
e12	( 6	22	7 );
e13	( 23	7	22 );
e14	( 7	23	8 );
e15	( 24	8	23 );
e16	( 8	24	9 );
e17	( 25	9	24 );
e18	( 9	25	10 );
e19	( 26	10	25 );
e20	( 10	26	11 );
e21	( 27	11	26 );
e22	( 11	27	12 );
e23	( 28	12	27 );
e24	( 12	28	13 );
e25	( 29	13	28 );
e26	( 13	29	14 );
e27	( 30	14	29 );
e28	( 14	30	15 );
e29	( 31	15	30 );
e30	( 15	31	0 );
e31	( 16	0	31 );
e32	( 16	32	17 );
e33	( 33	17	32 );
e34	( 17	33	18 );
e35	( 34	18	33 );
e36	( 18	34	19 );
e37	( 35	19	34 );
e38	( 19	35	20 );
e39	( 36	20	35 );
e40	( 20	36	21 );
e41	( 37	21	36 );
e42	( 21	37	22 );
e43	( 38	22	37 );
e44	( 22	38	23 );
e45	( 39	23	38 );
e46	( 23	39	24 );
e47	( 40	24	39 );
e48	( 24	40	25 );
e49	( 41	25	40 );
e50	( 25	41	26 );
e51	( 42	26	41 );
e52	( 26	42	27 );
e53	( 43	27	42 );
e54	( 27	43	28 );
e55	( 44	28	43 );
e56	( 28	44	29 );
e57	( 45	29	44 );
e58	( 29	45	30 );
e59	( 46	30	45 );
e60	( 30	46	31 );
e61	( 47	31	46 );
e62	( 31	47	16 );
e63	( 32	16	47 );
e64	( 32	48	33 );
e65	( 49	33	48 );
e66	( 33	49	34 );
e67	( 50	34	49 );
e68	( 34	50	35 );
e69	( 51	35	50 );
e70	( 35	51	36 );
e71	( 52	36	51 );
e72	( 36	52	37 );
e73	( 53	37	52 );
e74	( 37	53	38 );
e75	( 54	38	53 );
e76	( 38	54	39 );
e77	( 55	39	54 );
e78	( 39	55	40 );
e79	( 56	40	55 );
e80	( 40	56	41 );
e81	( 57	41	56 );
e82	( 41	57	42 );
e83	( 58	42	57 );
e84	( 42	58	43 );
e85	( 59	43	58 );
e86	( 43	59	44 );
e87	( 60	44	59 );
e88	( 44	60	45 );
e89	( 61	45	60 );
e90	( 45	61	46 );
e91	( 62	46	61 );
e92	( 46	62	47 );
e93	( 63	47	62 );
e94	( 47	63	32 );
e95	( 48	32	63 );
e96	( 48	64	49 );
e97	( 65	49	64 );
e98	( 49	65	50 );
e99	( 66	50	65 );
...
e319	( 176	160	191 );
}
