2small_sylinder_sn0.25U02/constant/netPoint
FoamFile
{
    version     1906;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      position;
}
// >>>>>>>>>>>>>>>>>>>>>>>>>>Hui Cheng>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> //
{
numOfPoint   192;
p0	( 0.05	0.0	0.0 );
p1	( 0.04619397662556434	0.01913417161825449	0.0 );
p2	( 0.03535533905932738	0.035355339059327376	0.0 );
p3	( 0.019134171618254495	0.04619397662556434	0.0 );
p4	( 3.061616997868383e-18	0.05	0.0 );
p5	( -0.019134171618254488	0.04619397662556434	0.0 );
p6	( -0.035355339059327376	0.03535533905932738	0.0 );
p7	( -0.04619397662556434	0.019134171618254495	0.0 );
p8	( -0.05	6.123233995736766e-18	0.0 );
p9	( -0.04619397662556435	-0.019134171618254484	0.0 );
p10	( -0.03535533905932738	-0.035355339059327376	0.0 );
p11	( -0.01913417161825452	-0.04619397662556433	0.0 );
p12	( -9.184850993605149e-18	-0.05	0.0 );
p13	( 0.0191341716182545	-0.046193976625564334	0.0 );
p14	( 0.03535533905932737	-0.03535533905932738	0.0 );
p15	( 0.04619397662556433	-0.019134171618254522	0.0 );
p16	( 0.05	0.0	-0.02 );
p17	( 0.04619397662556434	0.01913417161825449	-0.02 );
p18	( 0.03535533905932738	0.035355339059327376	-0.02 );
p19	( 0.019134171618254495	0.04619397662556434	-0.02 );
p20	( 3.061616997868383e-18	0.05	-0.02 );
p21	( -0.019134171618254488	0.04619397662556434	-0.02 );
p22	( -0.035355339059327376	0.03535533905932738	-0.02 );
p23	( -0.04619397662556434	0.019134171618254495	-0.02 );
p24	( -0.05	6.123233995736766e-18	-0.02 );
p25	( -0.04619397662556435	-0.019134171618254484	-0.02 );
p26	( -0.03535533905932738	-0.035355339059327376	-0.02 );
p27	( -0.01913417161825452	-0.04619397662556433	-0.02 );
p28	( -9.184850993605149e-18	-0.05	-0.02 );
p29	( 0.0191341716182545	-0.046193976625564334	-0.02 );
p30	( 0.03535533905932737	-0.03535533905932738	-0.02 );
p31	( 0.04619397662556433	-0.019134171618254522	-0.02 );
p32	( 0.05	0.0	-0.04 );
p33	( 0.04619397662556434	0.01913417161825449	-0.04 );
p34	( 0.03535533905932738	0.035355339059327376	-0.04 );
p35	( 0.019134171618254495	0.04619397662556434	-0.04 );
p36	( 3.061616997868383e-18	0.05	-0.04 );
p37	( -0.019134171618254488	0.04619397662556434	-0.04 );
p38	( -0.035355339059327376	0.03535533905932738	-0.04 );
p39	( -0.04619397662556434	0.019134171618254495	-0.04 );
p40	( -0.05	6.123233995736766e-18	-0.04 );
p41	( -0.04619397662556435	-0.019134171618254484	-0.04 );
p42	( -0.03535533905932738	-0.035355339059327376	-0.04 );
p43	( -0.01913417161825452	-0.04619397662556433	-0.04 );
p44	( -9.184850993605149e-18	-0.05	-0.04 );
p45	( 0.0191341716182545	-0.046193976625564334	-0.04 );
p46	( 0.03535533905932737	-0.03535533905932738	-0.04 );
p47	( 0.04619397662556433	-0.019134171618254522	-0.04 );
p48	( 0.05	0.0	-0.06000000000000001 );
p49	( 0.04619397662556434	0.01913417161825449	-0.06000000000000001 );
p50	( 0.03535533905932738	0.035355339059327376	-0.06000000000000001 );
p51	( 0.019134171618254495	0.04619397662556434	-0.06000000000000001 );
p52	( 3.061616997868383e-18	0.05	-0.06000000000000001 );
p53	( -0.019134171618254488	0.04619397662556434	-0.06000000000000001 );
p54	( -0.035355339059327376	0.03535533905932738	-0.06000000000000001 );
p55	( -0.04619397662556434	0.019134171618254495	-0.06000000000000001 );
p56	( -0.05	6.123233995736766e-18	-0.06000000000000001 );
p57	( -0.04619397662556435	-0.019134171618254484	-0.06000000000000001 );
p58	( -0.03535533905932738	-0.035355339059327376	-0.06000000000000001 );
p59	( -0.01913417161825452	-0.04619397662556433	-0.06000000000000001 );
p60	( -9.184850993605149e-18	-0.05	-0.06000000000000001 );
p61	( 0.0191341716182545	-0.046193976625564334	-0.06000000000000001 );
p62	( 0.03535533905932737	-0.03535533905932738	-0.06000000000000001 );
p63	( 0.04619397662556433	-0.019134171618254522	-0.06000000000000001 );
p64	( 0.05	0.0	-0.08 );
p65	( 0.04619397662556434	0.01913417161825449	-0.08 );
p66	( 0.03535533905932738	0.035355339059327376	-0.08 );
p67	( 0.019134171618254495	0.04619397662556434	-0.08 );
p68	( 3.061616997868383e-18	0.05	-0.08 );
p69	( -0.019134171618254488	0.04619397662556434	-0.08 );
p70	( -0.035355339059327376	0.03535533905932738	-0.08 );
p71	( -0.04619397662556434	0.019134171618254495	-0.08 );
p72	( -0.05	6.123233995736766e-18	-0.08 );
p73	( -0.04619397662556435	-0.019134171618254484	-0.08 );
p74	( -0.03535533905932738	-0.035355339059327376	-0.08 );
p75	( -0.01913417161825452	-0.04619397662556433	-0.08 );
p76	( -9.184850993605149e-18	-0.05	-0.08 );
p77	( 0.0191341716182545	-0.046193976625564334	-0.08 );
p78	( 0.03535533905932737	-0.03535533905932738	-0.08 );
p79	( 0.04619397662556433	-0.019134171618254522	-0.08 );
p80	( 0.05	0.0	-0.1 );
p81	( 0.04619397662556434	0.01913417161825449	-0.1 );
p82	( 0.03535533905932738	0.035355339059327376	-0.1 );
p83	( 0.019134171618254495	0.04619397662556434	-0.1 );
p84	( 3.061616997868383e-18	0.05	-0.1 );
p85	( -0.019134171618254488	0.04619397662556434	-0.1 );
p86	( -0.035355339059327376	0.03535533905932738	-0.1 );
p87	( -0.04619397662556434	0.019134171618254495	-0.1 );
p88	( -0.05	6.123233995736766e-18	-0.1 );
p89	( -0.04619397662556435	-0.019134171618254484	-0.1 );
p90	( -0.03535533905932738	-0.035355339059327376	-0.1 );
p91	( -0.01913417161825452	-0.04619397662556433	-0.1 );
p92	( -9.184850993605149e-18	-0.05	-0.1 );
p93	( 0.0191341716182545	-0.046193976625564334	-0.1 );
p94	( 0.03535533905932737	-0.03535533905932738	-0.1 );
p95	( 0.04619397662556433	-0.019134171618254522	-0.1 );
p96	( 0.25	0.0	0.0 );
p97	( 0.24619397662556436	0.01913417161825449	0.0 );
p98	( 0.2353553390593274	0.035355339059327376	0.0 );
p99	( 0.2191341716182545	0.04619397662556434	0.0 );
p100	( 0.2	0.05	0.0 );
p101	( 0.18086582838174553	0.04619397662556434	0.0 );
p102	( 0.16464466094067265	0.03535533905932738	0.0 );
p103	( 0.15380602337443566	0.019134171618254495	0.0 );
p104	( 0.15000000000000002	6.123233995736766e-18	0.0 );
p105	( 0.15380602337443566	-0.019134171618254484	0.0 );
p106	( 0.16464466094067262	-0.035355339059327376	0.0 );
p107	( 0.1808658283817455	-0.04619397662556433	0.0 );
p108	( 0.2	-0.05	0.0 );
p109	( 0.21913417161825452	-0.046193976625564334	0.0 );
p110	( 0.23535533905932737	-0.03535533905932738	0.0 );
p111	( 0.24619397662556433	-0.019134171618254522	0.0 );
p112	( 0.25	0.0	-0.02 );
p113	( 0.24619397662556436	0.01913417161825449	-0.02 );
p114	( 0.2353553390593274	0.035355339059327376	-0.02 );
p115	( 0.2191341716182545	0.04619397662556434	-0.02 );
p116	( 0.2	0.05	-0.02 );
p117	( 0.18086582838174553	0.04619397662556434	-0.02 );
p118	( 0.16464466094067265	0.03535533905932738	-0.02 );
p119	( 0.15380602337443566	0.019134171618254495	-0.02 );
p120	( 0.15000000000000002	6.123233995736766e-18	-0.02 );
p121	( 0.15380602337443566	-0.019134171618254484	-0.02 );
p122	( 0.16464466094067262	-0.035355339059327376	-0.02 );
p123	( 0.1808658283817455	-0.04619397662556433	-0.02 );
p124	( 0.2	-0.05	-0.02 );
p125	( 0.21913417161825452	-0.046193976625564334	-0.02 );
p126	( 0.23535533905932737	-0.03535533905932738	-0.02 );
p127	( 0.24619397662556433	-0.019134171618254522	-0.02 );
p128	( 0.25	0.0	-0.04 );
p129	( 0.24619397662556436	0.01913417161825449	-0.04 );
p130	( 0.2353553390593274	0.035355339059327376	-0.04 );
p131	( 0.2191341716182545	0.04619397662556434	-0.04 );
p132	( 0.2	0.05	-0.04 );
p133	( 0.18086582838174553	0.04619397662556434	-0.04 );
p134	( 0.16464466094067265	0.03535533905932738	-0.04 );
p135	( 0.15380602337443566	0.019134171618254495	-0.04 );
p136	( 0.15000000000000002	6.123233995736766e-18	-0.04 );
p137	( 0.15380602337443566	-0.019134171618254484	-0.04 );
p138	( 0.16464466094067262	-0.035355339059327376	-0.04 );
p139	( 0.1808658283817455	-0.04619397662556433	-0.04 );
p140	( 0.2	-0.05	-0.04 );
p141	( 0.21913417161825452	-0.046193976625564334	-0.04 );
p142	( 0.23535533905932737	-0.03535533905932738	-0.04 );
p143	( 0.24619397662556433	-0.019134171618254522	-0.04 );
p144	( 0.25	0.0	-0.06000000000000001 );
p145	( 0.24619397662556436	0.01913417161825449	-0.06000000000000001 );
p146	( 0.2353553390593274	0.035355339059327376	-0.06000000000000001 );
p147	( 0.2191341716182545	0.04619397662556434	-0.06000000000000001 );
p148	( 0.2	0.05	-0.06000000000000001 );
p149	( 0.18086582838174553	0.04619397662556434	-0.06000000000000001 );
p150	( 0.16464466094067265	0.03535533905932738	-0.06000000000000001 );
p151	( 0.15380602337443566	0.019134171618254495	-0.06000000000000001 );
p152	( 0.15000000000000002	6.123233995736766e-18	-0.06000000000000001 );
p153	( 0.15380602337443566	-0.019134171618254484	-0.06000000000000001 );
p154	( 0.16464466094067262	-0.035355339059327376	-0.06000000000000001 );
p155	( 0.1808658283817455	-0.04619397662556433	-0.06000000000000001 );
p156	( 0.2	-0.05	-0.06000000000000001 );
p157	( 0.21913417161825452	-0.046193976625564334	-0.06000000000000001 );
p158	( 0.23535533905932737	-0.03535533905932738	-0.06000000000000001 );
p159	( 0.24619397662556433	-0.019134171618254522	-0.06000000000000001 );
p160	( 0.25	0.0	-0.08 );
p161	( 0.24619397662556436	0.01913417161825449	-0.08 );
p162	( 0.2353553390593274	0.035355339059327376	-0.08 );
p163	( 0.2191341716182545	0.04619397662556434	-0.08 );
p164	( 0.2	0.05	-0.08 );
p165	( 0.18086582838174553	0.04619397662556434	-0.08 );
p166	( 0.16464466094067265	0.03535533905932738	-0.08 );
p167	( 0.15380602337443566	0.019134171618254495	-0.08 );
p168	( 0.15000000000000002	6.123233995736766e-18	-0.08 );
p169	( 0.15380602337443566	-0.019134171618254484	-0.08 );
p170	( 0.16464466094067262	-0.035355339059327376	-0.08 );
p171	( 0.1808658283817455	-0.04619397662556433	-0.08 );
p172	( 0.2	-0.05	-0.08 );
p173	( 0.21913417161825452	-0.046193976625564334	-0.08 );
p174	( 0.23535533905932737	-0.03535533905932738	-0.08 );
p175	( 0.24619397662556433	-0.019134171618254522	-0.08 );
p176	( 0.25	0.0	-0.1 );
p177	( 0.24619397662556436	0.01913417161825449	-0.1 );
p178	( 0.2353553390593274	0.035355339059327376	-0.1 );
p179	( 0.2191341716182545	0.04619397662556434	-0.1 );
p180	( 0.2	0.05	-0.1 );
p181	( 0.18086582838174553	0.04619397662556434	-0.1 );
p182	( 0.16464466094067265	0.03535533905932738	-0.1 );
p183	( 0.15380602337443566	0.019134171618254495	-0.1 );
p184	( 0.15000000000000002	6.123233995736766e-18	-0.1 );
p185	( 0.15380602337443566	-0.019134171618254484	-0.1 );
p186	( 0.16464466094067262	-0.035355339059327376	-0.1 );
p187	( 0.1808658283817455	-0.04619397662556433	-0.1 );
p188	( 0.2	-0.05	-0.1 );
p189	( 0.21913417161825452	-0.046193976625564334	-0.1 );
p190	( 0.23535533905932737	-0.03535533905932738	-0.1 );
p191	( 0.24619397662556433	-0.019134171618254522	-0.1 );
}
