2small_sylinder_sn0.25U02/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                                 Euler;
}

gradSchemes
{
    default                                 Gauss linear;
}

divSchemes
{
    default                                 none;
    div(phi,U)                              Gauss limitedLinearV 1;
    div(phi,k)                              Gauss limitedLinear 1;
    div(phi,omega)                          bounded Gauss limitedLinear 1;
    div(phi,v2)                             bounded Gauss limitedLinear 1;
    div(phi,gamma)                          bounded Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
    div(div(phi,U))                         Gauss linear;

}

laplacianSchemes
{
    default                                 Gauss linear corrected;
}

interpolationSchemes
{
    default                                 linear;
}

snGradSchemes
{
    default                                 corrected;
}

fluxRequired
{
    default                                 no;
    pcorr;
    p;
}
wallDist
{
    method Poisson;
}

// ************************************************************************* //
