2small_sylinder_sn0.25U02/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver                GAMG;
        tolerance             1e-06;
        relTol                0;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 10;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }


    pFinal
    {
        solver                GAMG;
        tolerance             1e-06;
        relTol                0;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 10;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }


  "(yPsi|yPsiFinal)"
  {
    solver          		GAMG;
    smoother        		GaussSeidel;
    cacheAgglomeration 	true;
    nCellsInCoarsestLevel 10;
    agglomerator    		faceAreaPair;
    mergeLevels     		1;
    tolerance       		1e-06;
    relTol          		0;
  }


    "(U|k|nuTilda|omega|v2|gamma)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|nuTilda|omega|v2|gamma)Final"
    {
        $U;
        relTol          0;
    }

}
PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


    PIMPLE
    {
    nOuterCorrectors          1;
    nCorrectors               3;
    nNonOrthogonalCorrectors  0;
    pRefCell                  0;
    pRefValue                 0;
    }

    relaxationFactors
    {
    p                         0.2;
    U                         0.3;
    k                         1;
    epsilon                   1;
    }
// ************************************************************************* //
