2small_sylinder_sn0.25U02/system/topoSetDict.refineLevel1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.3;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    refinedLevel1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-20    -12    -12)
                (100     24      1);
        }
    }
);

// ************************************************************************* //
